WORKING - STORAGE SECTION.01 CHARACTER PIC X.01 ENCRYPTED - CHAR PIC X.PROCEDURE DIVISION.MOVE ZERO TO SHIFT - AMT ACCEPT CHARACTER
FROM USER SUBTRACT SHIFT - AMT
FROM CHARACTER GIVING ENCRYPTED - CHAR DISPLAY ENCRYPTED - CHAR STOP RUN.