IDENTIFICATION DIVISION.
   PROGRAM-ID. FIBONNACI.
   DATA DIVISION. 
   WORKING-STORAGE SECTION. 
      01 FIBO-NUMBER          PIC S9(4) COMP. 
      01 SERIES               PIC S9(4) OCCURS 20 TIMES.
      01 
